app/controllers/events_controller.rb

  def index
    @month = params[:month].to_i
    @year = params[:year].to_i

    if @month.zero? or @year.zero?
      @events = Event.all
---
SELECT * FROM "events" WHERE ((start_at >= '2009-11-01 00:00:00') AND (start_at < '2009-12-01 00:00:00')) ORDER BY start_at ASC

  def show
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 3)

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 11)

  def create
    # set the start and end times correctly for all day events
    if params[:event][:all_day] == "1"
      params[:event]["start_at(4i)"], params[:event]["start_at(5i)"] = "00", "00"
      params[:event]["end_at(4i)"], params[:event]["end_at(5i)"] = "23", "59"
    end

    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "end_at", "updated_at", "all_day", "start_at", "created_at") VALUES('Bowling', '2009-12-04 23:59:00', '2009-12-03 22:22:22', 't', '2009-12-04 00:00:00', '2009-12-03 22:22:22')

  def update
    @event = Event.find(params[:id])

    # set the start and end times correctly for all day events
    if params[:event][:all_day] == "1"
      params[:event]["start_at(4i)"], params[:event]["start_at(5i)"] = "00", "00"
      params[:event]["end_at(4i)"], params[:event]["end_at(5i)"] = "23", "59"
    end

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM "events" WHERE ("events"."id" = 7)
UPDATE "events" SET "all_day" = 'f', "notes" = 'It was great!', "updated_at" = '2009-12-06 21:53:41' WHERE "id" = 7

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT * FROM "events" WHERE ("events"."id" = 12)
DELETE FROM "events" WHERE "id" = 12